Конфигурация/InformationRegisters/мпи_ЗначенияКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>мпи_ЗначенияКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКатегории</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мпи_ВидыКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мпи_КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/мпи_ЗначенияКатегорийНоменклатуры/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого ТекЗапись Из ЭтотОбъект ЦИкл
		Если ТекЗапись.Основная ТОгда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект,
		|	мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории
		|ИЗ
		|	РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|ГДЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект = &НоменклатураОбъект
		|	И мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегории
		|	И мпи_ЗначенияКатегорийНоменклатуры.Основная";
		Запрос.УстановитьПараметр("НоменклатураОбъект", ТекЗапись.НоменклатураОбъект);
		Запрос.УстановитьПараметр("ВидКатегории", ТекЗапись.ВидКатегории);
		Если Запрос.Выполнить().Пустой() ТОгда
			ТекЗапись.Основная = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
